In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv('illiteracy.txt', header=0, sep='\t')

In [3]:
data.head()

   Country  Illit  Births
0  Albania   20.5    1.78
1  Algeria   39.1    2.44
2  Bahrain   15.0    2.34
3   Belize    5.9    2.97
4    Benin   73.5    5.60

In [4]:
data.drop('Country', axis=1).corr()

           Illit    Births
Illit   1.000000  0.768663
Births  0.768663  1.000000

In [5]:
from scipy import stats

In [8]:
stats.spearmanr(data[['Illit']], data[['Births']])

SpearmanrResult(correlation=0.752962213732534, pvalue=2.0858571221460674e-18)

In [9]:
stats.spearmanr(data.drop('Country', axis=1))

SpearmanrResult(correlation=0.752962213732534, pvalue=2.0858571221460674e-18)

In [10]:
data = pd.read_csv('water.txt', header=0, sep='\t')

In [11]:
data.head()

  location        town  mortality  hardness
0    South        Bath       1247       105
1    North  Birkenhead       1668        17
2    South  Birmingham       1466         5
3    North   Blackburn       1800        14
4    North   Blackpool       1609        18

In [12]:
data[['mortality', 'hardness']].corr()

           mortality  hardness
mortality   1.000000 -0.654849
hardness   -0.654849  1.000000